Revit 2027 API
LineLoad.MomentVector2 Property
 The moment vector applied to the end point of the line load, oriented according to OrientTo setting.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ MomentVector2 { get; set; }
Public Property MomentVector2 As XYZ
	Get
	Set
public:
property XYZ^ MomentVector2 {
	XYZ^ get ();
	void set (XYZ^ value);
}
member MomentVector2 : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 The default force unit is kN-m/m for metric, and kip-ft/ft for imperial. Use UnitUtils class methods to convert value from or to internal units.
See Also
Reference
LineLoad Class
Autodesk.Revit.DB.Structure Namespace